app/Controllers/Assets.php

    public function index()
    {
        $model = new AssetModel();
        $data['assets'] = $model->findAll();
---
SELECT *
FROM `assets`