app/Controllers/AuthController.php

    public function loginProcess()
    {
        $session = session();
        $model = new UserModel();
        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');
        $data = $model->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'rizki'
 LIMIT 1