app/Controllers/Changes.php

SELECT *
FROM `changes`
---
    public function index()
    {
        $model = new ChangeModel();
        $data['changes'] = $model->findAll();