app/Controllers/Dashboard.php

    public function index()
    {
        $incidentModel = new IncidentModel();
        $inventoryModel = new InventoryModel();

        // Get the current date and the date one month ago
        $currentDate = date('Y-m-d H:i:s');
        $oneMonthAgo = date('Y-m-d H:i:s', strtotime('-1 month'));

        // Get incident data from the last month
        $incidents = $incidentModel->select('severity, COUNT(*) as count')
                                   ->where('created_at >=', $oneMonthAgo)
                                   ->where('created_at <=', $currentDate)
                                   ->groupBy('severity')
                                   ->findAll();

        // Prepare data for the chart
        $chartData = [
            'labels' => [],
            'data' => [],
        ];

        foreach ($incidents as $incident) {
            $chartData['labels'][] = ucfirst($incident['severity']);
            $chartData['data'][] = $incident['count'];
        }

        // Get inventory count
        $inventoryCount = $inventoryModel->countAll();
---
SELECT `severity`, COUNT(*) as count
FROM `incidents`
WHERE `created_at` >= '2024-06-01 18:15:22'
AND `created_at` <= '2024-07-01 18:15:22'
GROUP BY `severity`
SELECT COUNT(*) AS `numrows` FROM `inventory`