app/Controllers/InventoryController.php

    public function index()
    {
        $model = new InventoryModel();
        $data['inventory'] = $model->findAll();
---
SELECT *
FROM `inventory`