app/Controllers/MonitoringParameters.php

    public function index()
    {
        $model = new MonitoringParametersModel();
        $data['parameters'] = $model->findAll();
---
SELECT *
FROM `monitoring_parameters`