app/Controllers/Reports.php

    public function index()
    {
        // Load necessary data for filters
        $incidentModel = new IncidentModel();
        $data['incidents'] = $incidentModel->findAll();
---
SELECT *
FROM `incidents`